run/gittracked/MHC/RSM_worked/0/R
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0.0049 0 0 0.0049 0 0.0049);

boundaryField
{
    bottomoutlet
    {
        type            zeroGradient;
    }
    negyinlet
    {
        type            fixedValue;
        value           uniform (0.0049 0 0 0.0049 0 0.0049);
    }
    posyinlet
    {
        type            fixedValue;
        value           uniform (0.0049 0 0 0.0049 0 0.0049);
    }
    topoutlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
